performance_tests/artillery_stress_test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 50
      rampTo: 100
      name: "Phase 1: Stressing (100 users/s)"
    - duration: 60
      arrivalRate: 100
      rampTo: 250
      name: "Phase 2: Heavy Load (250 users/s)"
    - duration: 60
      arrivalRate: 250
      rampTo: 500
      name: "Phase 3: Breaking Point Hunt (500 users/s)"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Intensive Search and Access"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@foodplan.local"
            password: "Admin!234"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/foods/search?query=a"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - get:
          url: "/api/foods/categories"
          headers:
            Authorization: "Bearer {{ authToken }}"